[
  {
    "id": 1,
    "kasus": "Seorang warga negara Indonesia ditolak masuk ke sebuah restoran karena mengenakan atribut keagamaan tertentu. Manajemen restoran beralasan bahwa kebijakan tersebut untuk menjaga netralitas tempat.",
    "pertanyaan": "Apakah tindakan restoran tersebut melanggar UUD 1945? Jika ya, sebutkan bab, pasal, dan ayat yang dilanggar.",
    "jawaban": {
      "bab": "Bab XI - Agama",
      "pasal": "Pasal 29",
      "ayat": "Ayat (2)",
      "penjelasan": "Pasal 29 ayat (2) menyatakan bahwa negara menjamin kemerdekaan tiap-tiap penduduk untuk memeluk agamanya masing-masing dan untuk beribadat menurut agamanya dan kepercayaannya itu. Penolakan berdasarkan atribut keagamaan melanggar hak tersebut."
    }
  },
  {
    "id": 2,
    "kasus": "Pemerintah daerah menetapkan peraturan yang membatasi akses pendidikan dasar hanya bagi anak-anak yang berasal dari keluarga mampu secara finansial.",
    "pertanyaan": "Apakah kebijakan ini sesuai dengan UUD 1945? Jika tidak, identifikasi bab, pasal, dan ayat yang relevan.",
    "jawaban": {
      "bab": "Bab XIII - Pendidikan dan Kebudayaan",
      "pasal": "Pasal 31",
      "ayat": "Ayat (1) dan (2)",
      "penjelasan": "Pasal 31 ayat (1) menyatakan bahwa setiap warga negara berhak mendapat pendidikan. Ayat (2) menegaskan bahwa setiap warga negara wajib mengikuti pendidikan dasar dan pemerintah wajib membiayainya. Kebijakan yang membatasi akses berdasarkan kemampuan finansial bertentangan dengan ketentuan ini."
    }
  },
  {
    "id": 3,
    "kasus": "Seorang jurnalis ditangkap tanpa surat perintah karena menulis artikel yang mengkritik kebijakan pemerintah.",
    "pertanyaan": "Apakah penangkapan tersebut melanggar UUD 1945? Sebutkan bab, pasal, dan ayat yang terkait.",
    "jawaban": {
      "bab": "Bab XA - Hak Asasi Manusia",
      "pasal": "Pasal 28E",
      "ayat": "Ayat (3)",
      "penjelasan": "Pasal 28E ayat (3) menyatakan bahwa setiap orang berhak atas kebebasan berserikat, berkumpul, dan mengeluarkan pendapat. Penangkapan tanpa surat perintah karena mengkritik pemerintah melanggar hak tersebut."
    }
  },
  {
    "id": 4,
    "kasus": "Sebuah perusahaan swasta mempekerjakan anak-anak di bawah usia 15 tahun untuk bekerja penuh waktu di pabrik.",
    "pertanyaan": "Apakah praktik ini melanggar UUD 1945? Identifikasi bab, pasal, dan ayat yang dilanggar.",
    "jawaban": {
      "bab": "Bab XA - Hak Asasi Manusia",
      "pasal": "Pasal 28B",
      "ayat": "Ayat (2)",
      "penjelasan": "Pasal 28B ayat (2) menyatakan bahwa setiap anak berhak atas kelangsungan hidup, tumbuh, dan berkembang serta berhak atas perlindungan dari kekerasan dan diskriminasi. Mempekerjakan anak di bawah umur melanggar hak-hak tersebut."
    }
  },
  {
    "id": 5,
    "kasus": "Pemerintah menetapkan kebijakan yang membatasi warga negara tertentu untuk memilih dalam pemilihan umum berdasarkan latar belakang etnis.",
    "pertanyaan": "Apakah kebijakan ini sesuai dengan UUD 1945? Jika tidak, sebutkan bab, pasal, dan ayat yang relevan.",
    "jawaban": {
      "bab": "Bab XA - Hak Asasi Manusia",
      "pasal": "Pasal 28I",
      "ayat": "Ayat (2)",
      "penjelasan": "Pasal 28I ayat (2) menyatakan bahwa setiap orang berhak bebas dari perlakuan yang bersifat diskriminatif atas dasar apapun. Membatasi hak memilih berdasarkan etnis melanggar prinsip non-diskriminasi yang dijamin oleh UUD 1945."
    }
  },
  {
    "id": 6,
    "kasus": "Seorang warga negara Indonesia ditolak untuk mendapatkan pelayanan kesehatan di rumah sakit pemerintah karena tidak memiliki kartu identitas.",
    "pertanyaan": "Apakah penolakan tersebut melanggar UUD 1945? Jika ya, sebutkan bab, pasal, dan ayat yang dilanggar.",
    "jawaban": {
      "bab": "Bab XA - Hak Asasi Manusia",
      "pasal": "Pasal 28H",
      "ayat": "Ayat (1)",
      "penjelasan": "Pasal 28H ayat (1) menyatakan bahwa setiap orang berhak hidup sejahtera lahir dan batin, bertempat tinggal, dan mendapatkan pelayanan kesehatan. Penolakan pelayanan kesehatan melanggar hak tersebut."
    }
  },
  {
    "id": 7,
    "kasus": "Sebuah media sosial memblokir akun seorang pengguna karena mengungkapkan pendapat politiknya yang berbeda dengan pemerintah.",
    "pertanyaan": "Apakah tindakan ini melanggar UUD 1945? Sebutkan bab, pasal, dan ayat yang terkait.",
    "jawaban": {
      "bab": "Bab XA - Hak Asasi Manusia",
      "pasal": "Pasal 28E",
      "ayat": "Ayat (3)",
      "penjelasan": "Pasal 28E ayat (3) menyatakan bahwa setiap orang berhak atas kebebasan berserikat, berkumpul, dan mengeluarkan pendapat. Pemblokiran akun karena pendapat politik melanggar hak tersebut."
    }
  },
  {
    "id": 8,
    "kasus": "Pemerintah menetapkan peraturan yang melarang penggunaan bahasa daerah dalam acara resmi di sekolah-sekolah.",
    "pertanyaan": "Apakah peraturan ini sesuai dengan UUD 1945? Jika tidak, identifikasi bab, pasal, dan ayat yang relevan.",
    "jawaban": {
      "bab": "Bab XIII - Pendidikan dan Kebudayaan",
      "pasal": "Pasal 32",
      "ayat": "Ayat (2)",
      "penjelasan": "Pasal 32 ayat (2) menyatakan bahwa negara menghormati dan memelihara bahasa daerah sebagai kekayaan budaya nasional. Larangan penggunaan bahasa daerah melanggar ketentuan ini."
    }
  },
  {
    "id": 9,
    "kasus": "Seorang warga negara Indonesia dipaksa untuk mengikuti agama tertentu oleh aparat desa.",
    "pertanyaan": "Apakah tindakan ini melanggar UUD 1945? Sebutkan bab, pasal, dan ayat yang dilanggar.",
    "jawaban": {
      "bab": "Bab XI - Agama",
      "pasal": "Pasal 29",
      "ayat": "Ayat (2)",
      "penjelasan": "Pasal 29 ayat (2) menyatakan bahwa negara menjamin kemerdekaan tiap-tiap penduduk untuk memeluk agamanya masing-masing dan untuk beribadat menurut agamanya dan kepercayaannya itu. Pemaksaan agama melanggar hak tersebut."
    }
  },
  {
    "id": 10,
    "kasus": "Pemerintah daerah menetapkan kebijakan yang hanya memperbolehkan laki-laki untuk menduduki jabatan tertentu di pemerintahan.",
    "pertanyaan": "Apakah kebijakan ini sesuai dengan UUD 1945? Jika tidak, sebutkan bab, pasal, dan ayat yang relevan.",
    "jawaban": {
      "bab": "Bab XA - Hak Asasi Manusia",
      "pasal": "Pasal 28D",
      "ayat": "Ayat (3)",
      "penjelasan": "Pasal 28D ayat (3) menyatakan bahwa setiap warga negara berhak memperoleh kesempatan yang sama dalam pemerintahan. Kebijakan yang membatasi berdasarkan jenis kelamin melanggar ketentuan ini."
    }
  }
]
